RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/inc/at32f4xx_ertc.h
/**
 **************************************************************************
 * File Name    : at32f4xx_ertc.h
 * Description  : at32f4xx ERTC header file
 * Date         : 2018-03-15
 * Version      : V1.0.4
 **************************************************************************
 */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __AT32F4xx_ERTC_H
#define __AT32F4xx_ERTC_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "at32f4xx.h"

/** @addtogroup at32f4xx_StdPeriph_Driver
  * @{
  */

/** @addtogroup ERTC
  * @{
  */

/* Exported types ------------------------------------------------------------*/

/**
  * @brief  ERTC Init structures definition
  */
typedef struct
{
  uint32_t ERTC_HourFormat;   /*!< Specifies the ERTC Hour Format.
                             This parameter can be a value of @ref RTC_Hour_Formats */

  uint32_t ERTC_AsynchPrediv; /*!< Specifies the ERTC Asynchronous Predivider value.
                             This parameter must be set to a value lower than 0x7F */

  uint32_t ERTC_SynchPrediv;  /*!< Specifies the ERTC Synchronous Predivider value.
                             This parameter must be set to a value lower than 0x7FFF */
}ERTC_InitType;

/**
  * @brief  ERTC Time structure definition
  */
typedef struct
{
  uint8_t ERTC_Hours;    /*!< Specifies the ERTC Time Hour.
                        This parameter must be set to a value in the 0-12 range
                        if the ERTC_HourFormat_12 is selected or 0-23 range if
                        the ERTC_HourFormat_24 is selected. */

  uint8_t ERTC_Minutes;  /*!< Specifies the ERTC Time Minutes.
                        This parameter must be set to a value in the 0-59 range. */

  uint8_t ERTC_Seconds;  /*!< Specifies the ERTC Time Seconds.
                        This parameter must be set to a value in the 0-59 range. */

  uint8_t ERTC_AMPM;      /*!< Specifies the ERTC AM/PM Time.
                        This parameter can be a value of @ref RTC_AM_PM_Definitions */
}ERTC_TimeType;

/**
  * @brief  ERTC Date structure definition
  */
typedef struct
{
  uint8_t ERTC_WeekDay; /*!< Specifies the ERTC Date WeekDay.
                        This parameter can be a value of @ref RTC_WeekDay_Definitions */

  uint8_t ERTC_Month;   /*!< Specifies the ERTC Date Month (in BCD format).
                        This parameter can be a value of @ref RTC_Month_Date_Definitions */

  uint8_t ERTC_Date;     /*!< Specifies the ERTC Date.
                        This parameter must be set to a value in the 1-31 range. */

  uint8_t ERTC_Year;     /*!< Specifies the ERTC Date Year.
                        This parameter must be set to a value in the 0-99 range. */
}ERTC_DateType;

/**
  * @brief  ERTC Alarm structure definition
  */
typedef struct
{
  ERTC_TimeType ERTC_AlarmTime;     /*!< Specifies the ERTC Alarm Time members. */

  uint32_t ERTC_AlarmMask;            /*!< Specifies the ERTC Alarm Masks.
                                     This parameter can be a value of @ref RTC_AlarmMask_Definitions */

  uint32_t ERTC_AlarmDateWeekSel;  /*!< Specifies the ERTC Alarm is on Date or WeekDay.
                                     This parameter can be a value of @ref RTC_AlarmDateWeekDay_Definitions */

  uint8_t ERTC_AlarmDateWeek;      /*!< Specifies the ERTC Alarm Date/WeekDay.
                                     If the Alarm Date is selected, this parameter
                                     must be set to a value in the 1-31 range.
                                     If the Alarm WeekDay is selected, this
                                     parameter can be a value of @ref RTC_WeekDay_Definitions */
}ERTC_AlarmType;

/* Exported constants --------------------------------------------------------*/

/** @defgroup RTC_Exported_Constants
  * @{
  */


/** @defgroup RTC_Hour_Formats
  * @{
  */
#define ERTC_HourFormat_24              ((uint32_t)0x00000000)
#define ERTC_HourFormat_12              ((uint32_t)0x00000040)
#define IS_ERTC_HOUR_FORMAT(FORMAT)     (((FORMAT) == ERTC_HourFormat_12) || \
                                         ((FORMAT) == ERTC_HourFormat_24))
/**
  * @}
  */

/** @defgroup RTC_Asynchronous_Predivider
  * @{
  */
#define IS_ERTC_ASYNCH_PRDIV(PRDIV)   ((PRDIV) <= 0x7F)

/**
  * @}
  */


/** @defgroup RTC_Synchronous_Predivider
  * @{
  */
#define IS_ERTC_SYNCH_PRDIV(PRDIV)    ((PRDIV) <= 0x7FFF)

/**
  * @}
  */

/** @defgroup RTC_Time_Definitions
  * @{
  */
#define IS_ERTC_HOUR12(HOUR)            (((HOUR) > 0) && ((HOUR) <= 12))
#define IS_ERTC_HOUR24(HOUR)            ((HOUR) <= 23)
#define IS_ERTC_MINUTES(MINUTES)        ((MINUTES) <= 59)
#define IS_ERTC_SECONDS(SECONDS)        ((SECONDS) <= 59)

/**
  * @}
  */

/** @defgroup RTC_AM_PM_Definitions
  * @{
  */
#define ERTC_H12_AM                     ((uint8_t)0x00)
#define ERTC_H12_PM                     ((uint8_t)0x40)
#define IS_ERTC_H12(AMPM) (((AMPM) == ERTC_H12_AM) || ((AMPM) == ERTC_H12_PM))

/**
  * @}
  */

/** @defgroup RTC_Year_Date_Definitions
  * @{
  */
#define IS_ERTC_YEAR(YEAR)              ((YEAR) <= 99)

/**
  * @}
  */

/** @defgroup RTC_Month_Date_Definitions
  * @{
  */

/* Coded in BCD format */
#define ERTC_Month_JAN                  ((uint8_t)0x01)
#define ERTC_Month_FEB                  ((uint8_t)0x02)
#define ERTC_Month_MAR                  ((uint8_t)0x03)
#define ERTC_Month_APR                  ((uint8_t)0x04)
#define ERTC_Month_MAY                  ((uint8_t)0x05)
#define ERTC_Month_JUN                  ((uint8_t)0x06)
#define ERTC_Month_JUL                  ((uint8_t)0x07)
#define ERTC_Month_AUG                  ((uint8_t)0x08)
#define ERTC_Month_SEP                  ((uint8_t)0x09)
#define ERTC_Month_OCT                  ((uint8_t)0x10)
#define ERTC_Month_NOV                  ((uint8_t)0x11)
#define ERTC_Month_DEC                  ((uint8_t)0x12)
#define IS_ERTC_MONTH(MONTH)            (((MONTH) >= 1) && ((MONTH) <= 12))
#define IS_ERTC_DATE(DATE)              (((DATE) >= 1) && ((DATE) <= 31))

/**
  * @}
  */

