RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/inc/at32f4xx_ertc.h
/** @defgroup RTC_WeekDay_Definitions
  * @{
  */

#define ERTC_Week_MON                   ((uint8_t)0x01)
#define ERTC_Week_TUES                  ((uint8_t)0x02)
#define ERTC_Week_WED                   ((uint8_t)0x03)
#define ERTC_Week_THUR                  ((uint8_t)0x04)
#define ERTC_Week_FRI                   ((uint8_t)0x05)
#define ERTC_Week_SAT                   ((uint8_t)0x06)
#define ERTC_Week_SUN                   ((uint8_t)0x07)
#define IS_ERTC_WEEK(WEEK)      (((WEEK) == ERTC_Week_MON) || \
                                 ((WEEK) == ERTC_Week_TUES) || \
                                 ((WEEK) == ERTC_Week_WED) || \
                                 ((WEEK) == ERTC_Week_THUR) || \
                                 ((WEEK) == ERTC_Week_FRI) || \
                                 ((WEEK) == ERTC_Week_SAT) || \
                                 ((WEEK) == ERTC_Week_SUN))
/**
  * @}
  */


/** @defgroup RTC_Alarm_Definitions
  * @{
  */
#define IS_ERTC_ALARM_DATE_WEEK_DATE(DATE) (((DATE) > 0) && ((DATE) <= 31))
#define IS_ERTC_ALARM_DATE_WEEK_WEEK(WEEK) (((WEEK) == ERTC_Week_MON) || \
                                                    ((WEEK) == ERTC_Week_TUES) || \
                                                    ((WEEK) == ERTC_Week_WED) || \
                                                    ((WEEK) == ERTC_Week_THUR) || \
                                                    ((WEEK) == ERTC_Week_FRI) || \
                                                    ((WEEK) == ERTC_Week_SAT) || \
                                                    ((WEEK) == ERTC_Week_SUN))

/**
  * @}
  */


/** @defgroup RTC_AlarmDateWeekDay_Definitions
  * @{
  */
#define ERTC_AlarmDateWeekSel_Date       ((uint32_t)0x00000000)
#define ERTC_AlarmDateWeekSel_Week       ((uint32_t)0x40000000)

#define IS_ERTC_ALARM_DATE_WEEK_SEL(SEL) (((SEL) == ERTC_AlarmDateWeekSel_Date) || \
                                            ((SEL) == ERTC_AlarmDateWeekSel_Week))

/**
  * @}
  */


/** @defgroup RTC_AlarmMask_Definitions
  * @{
  */
#define ERTC_AlarmMask_None                ((uint32_t)0x00000000)
#define ERTC_AlarmMask_DateWeek            ((uint32_t)0x80000000)
#define ERTC_AlarmMask_Hours               ((uint32_t)0x00800000)
#define ERTC_AlarmMask_Minutes             ((uint32_t)0x00008000)
#define ERTC_AlarmMask_Seconds             ((uint32_t)0x00000080)
#define ERTC_AlarmMask_All                 ((uint32_t)0x80808080)
#define IS_ALARM_MASK(MASK)  (((MASK) & 0x7F7F7F7F) == (uint32_t)RESET)

/**
  * @}
  */

/** @defgroup RTC_Alarms_Definitions
  * @{
  */
#define ERTC_AlA                       ((uint32_t)0x00000100)
#define ERTC_AlB                       ((uint32_t)0x00000200)
#define IS_ERTC_ALARM(ALARM)     (((ALARM) == ERTC_AlA) || ((ALARM) == ERTC_AlB))
#define IS_ERTC_CMD_ALARM(ALARM) (((ALARM) & (ERTC_AlA | ERTC_AlB)) != (uint32_t)RESET)

/**
  * @}
  */

  /** @defgroup RTC_Alarm_Sub_Seconds_Masks_Definitions
  * @{
  */
#define ERTC_AlarmSubSecondMask_All          ((uint32_t)0x00000000) /*!< All Alarm SS fields are masked.
                                                                       There is no comparison on sub seconds
                                                                       for Alarm */
#define ERTC_AlarmSubSecondMask_SBS14_1      ((uint32_t)0x01000000) /*!< SS[14:1] are don't care in Alarm
                                                                       comparison. Only SS[0] is compared. */
#define ERTC_AlarmSubSecondMask_SBS14_2      ((uint32_t)0x02000000) /*!< SS[14:2] are don't care in Alarm
                                                                       comparison. Only SS[1:0] are compared */
#define ERTC_AlarmSubSecondMask_SBS14_3      ((uint32_t)0x03000000) /*!< SS[14:3] are don't care in Alarm
                                                                       comparison. Only SS[2:0] are compared */
#define ERTC_AlarmSubSecondMask_SBS14_4      ((uint32_t)0x04000000) /*!< SS[14:4] are don't care in Alarm
                                                                       comparison. Only SS[3:0] are compared */
#define ERTC_AlarmSubSecondMask_SBS14_5      ((uint32_t)0x05000000) /*!< SS[14:5] are don't care in Alarm
                                                                       comparison. Only SS[4:0] are compared */
#define ERTC_AlarmSubSecondMask_SBS14_6      ((uint32_t)0x06000000) /*!< SS[14:6] are don't care in Alarm
                                                                       comparison. Only SS[5:0] are compared */
#define ERTC_AlarmSubSecondMask_SBS14_7      ((uint32_t)0x07000000) /*!< SS[14:7] are don't care in Alarm
                                                                       comparison. Only SS[6:0] are compared */
#define ERTC_AlarmSubSecondMask_SBS14_8      ((uint32_t)0x08000000) /*!< SS[14:8] are don't care in Alarm
                                                                       comparison. Only SS[7:0] are compared */
#define ERTC_AlarmSubSecondMask_SBS14_9      ((uint32_t)0x09000000) /*!< SS[14:9] are don't care in Alarm
                                                                       comparison. Only SS[8:0] are compared */
#define ERTC_AlarmSubSecondMask_SBS14_10     ((uint32_t)0x0A000000) /*!< SS[14:10] are don't care in Alarm
                                                                       comparison. Only SS[9:0] are compared */
#define ERTC_AlarmSubSecondMask_SBS14_11     ((uint32_t)0x0B000000) /*!< SS[14:11] are don't care in Alarm
                                                                       comparison. Only SS[10:0] are compared */
#define ERTC_AlarmSubSecondMask_SBS14_12     ((uint32_t)0x0C000000) /*!< SS[14:12] are don't care in Alarm
                                                                       comparison.Only SS[11:0] are compared */
#define ERTC_AlarmSubSecondMask_SBS14_13     ((uint32_t)0x0D000000) /*!< SS[14:13] are don't care in Alarm
                                                                       comparison. Only SS[12:0] are compared */
#define ERTC_AlarmSubSecondMask_SBS14        ((uint32_t)0x0E000000) /*!< SS[14] is don't care in Alarm
                                                                       comparison.Only SS[13:0] are compared */
#define ERTC_AlarmSubSecondMask_None         ((uint32_t)0x0F000000) /*!< SS[14:0] are compared and must match
                                                                       to activate alarm. */
#define IS_ERTC_ALARM_SUB_SECOND_MASK(MASK)  (((MASK) == ERTC_AlarmSubSecondMask_All) || \
                                              ((MASK) == ERTC_AlarmSubSecondMask_SBS14_1) || \
                                              ((MASK) == ERTC_AlarmSubSecondMask_SBS14_2) || \
                                              ((MASK) == ERTC_AlarmSubSecondMask_SBS14_3) || \
                                              ((MASK) == ERTC_AlarmSubSecondMask_SBS14_4) || \
                                              ((MASK) == ERTC_AlarmSubSecondMask_SBS14_5) || \
                                              ((MASK) == ERTC_AlarmSubSecondMask_SBS14_6) || \
                                              ((MASK) == ERTC_AlarmSubSecondMask_SBS14_7) || \
                                              ((MASK) == ERTC_AlarmSubSecondMask_SBS14_8) || \
                                              ((MASK) == ERTC_AlarmSubSecondMask_SBS14_9) || \
                                              ((MASK) == ERTC_AlarmSubSecondMask_SBS14_10) || \
                                              ((MASK) == ERTC_AlarmSubSecondMask_SBS14_11) || \
                                              ((MASK) == ERTC_AlarmSubSecondMask_SBS14_12) || \
                                              ((MASK) == ERTC_AlarmSubSecondMask_SBS14_13) || \
                                              ((MASK) == ERTC_AlarmSubSecondMask_SBS14) || \
                                              ((MASK) == ERTC_AlarmSubSecondMask_None))
/**
  * @}
  */

/** @defgroup RTC_Alarm_Sub_Seconds_Value
  * @{
  */

