RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/inc/at32f4xx_ertc.h
#define IS_ERTC_ALARM_SUB_SECOND_VALUE(VALUE) ((VALUE) <= 0x00007FFF)

/**
  * @}
  */

/** @defgroup RTC_Wakeup_Timer_Definitions
  * @{
  */
#define ERTC_WakeUpClockSelect_RTCCLK_Div16        ((uint32_t)0x00000000)
#define ERTC_WakeUpClockSelect_RTCCLK_Div8         ((uint32_t)0x00000001)
#define ERTC_WakeUpClockSelect_RTCCLK_Div4         ((uint32_t)0x00000002)
#define ERTC_WakeUpClockSelect_RTCCLK_Div2         ((uint32_t)0x00000003)
#define ERTC_WakeUpClockSelect_CK_SPRE_16bits      ((uint32_t)0x00000004)
#define ERTC_WakeUpClockSelect_CK_SPRE_17bits      ((uint32_t)0x00000006)
#define IS_ERTC_WAKEUP_CLOCK_SELECT(CLOCK) (((CLOCK) == ERTC_WakeUpClockSelect_RTCCLK_Div16) || \
                                    ((CLOCK) == ERTC_WakeUpClockSelect_RTCCLK_Div8) || \
                                    ((CLOCK) == ERTC_WakeUpClockSelect_RTCCLK_Div4) || \
                                    ((CLOCK) == ERTC_WakeUpClockSelect_RTCCLK_Div2) || \
                                    ((CLOCK) == ERTC_WakeUpClockSelect_CK_SPRE_16bits) || \
                                    ((CLOCK) == ERTC_WakeUpClockSelect_CK_SPRE_17bits))
#define IS_ERTC_WAKEUP_COUNTER(COUNTER)  ((COUNTER) <= 0xFFFF)
/**
  * @}
  */

/** @defgroup RTC_Time_Stamp_Edges_definitions
  * @{
  */
#define ERTC_TimeStampEdge_Rising          ((uint32_t)0x00000000)
#define ERTC_TimeStampEdge_Falling         ((uint32_t)0x00000008)
#define IS_ERTC_TIMESTAMP_EDGE(EDGE) (((EDGE) == ERTC_TimeStampEdge_Rising) || \
                                     ((EDGE) == ERTC_TimeStampEdge_Falling))
/**
  * @}
  */

/** @defgroup RTC_Output_selection_Definitions
  * @{
  */
#define ERTC_Output_Disable             ((uint32_t)0x00000000)
#define ERTC_Output_AlarmA              ((uint32_t)0x00200000)
#define ERTC_Output_AlarmB              ((uint32_t)0x00400000)
#define ERTC_Output_WakeUp              ((uint32_t)0x00600000)

#define IS_ERTC_OUTPUT(OUTPUT) (((OUTPUT) == ERTC_Output_Disable) || \
                               ((OUTPUT) == ERTC_Output_AlarmA) || \
                               ((OUTPUT) == ERTC_Output_AlarmB) || \
                               ((OUTPUT) == ERTC_Output_WakeUp))

/**
  * @}
  */

/** @defgroup RTC_Output_Polarity_Definitions
  * @{
  */
#define ERTC_OutputPolarity_High           ((uint32_t)0x00000000)
#define ERTC_OutputPolarity_Low            ((uint32_t)0x00100000)
#define IS_ERTC_OUTPUT_OPOL(OPOL) (((OPOL) == ERTC_OutputPolarity_High) || \
                                ((OPOL) == ERTC_OutputPolarity_Low))
/**
  * @}
  */


/** @defgroup RTC_Digital_Calibration_Definitions
  * @{
  */
#define ERTC_DataCalSign_Positive            ((uint32_t)0x00000000)
#define ERTC_DataCalSign_Negative            ((uint32_t)0x00000080)
#define IS_ERTC_DATACAL_SIGN(SIGN) (((SIGN) == ERTC_DataCalSign_Positive) || \
                                 ((SIGN) == ERTC_DataCalSign_Negative))
#define IS_ERTC_DATACAL_VALUE(VALUE) ((VALUE) < 0x20)

/**
  * @}
  */

 /** @defgroup RTC_Calib_Output_selection_Definitions
  * @{
  */
#define ERTC_CalOutput_512Hz            ((uint32_t)0x00000000)
#define ERTC_CalOutput_1Hz              ((uint32_t)0x00080000)
#define IS_ERTC_CAL_OUTPUT(OUTPUT)  (((OUTPUT) == ERTC_CalOutput_512Hz) || \
                                      ((OUTPUT) == ERTC_CalOutput_1Hz))
/**
  * @}
  */

/** @defgroup RTC_Smooth_calib_period_Definitions
  * @{
  */
#define ERTC_SmoothCalPeriod_32sec   ((uint32_t)0x00000000) /*!<  if RTCCLK = 32768 Hz, Smooth calibation
                                                             period is 32s,  else 2exp20 RTCCLK seconds */
#define ERTC_SmoothCalPeriod_16sec   ((uint32_t)0x00002000) /*!<  if RTCCLK = 32768 Hz, Smooth calibration
                                                             period is 16s, else 2exp19 RTCCLK seconds */
#define ERTC_SmoothCalPeriod_8sec    ((uint32_t)0x00004000) /*!<  if RTCCLK = 32768 Hz, Smooth calibation
                                                             period is 8s, else 2exp18 RTCCLK seconds */
#define IS_ERTC_SMOOTH_CAL_PERIOD(PERIOD) (((PERIOD) == ERTC_SmoothCalPeriod_32sec) || \
                                             ((PERIOD) == ERTC_SmoothCalPeriod_16sec) || \
                                             ((PERIOD) == ERTC_SmoothCalPeriod_8sec))

/**
  * @}
  */

/** @defgroup RTC_Smooth_calib_Plus_pulses_Definitions
  * @{
  */
#define ERTC_SmoothCalAddPulses_Set    ((uint32_t)0x00008000) /*!<  The number of RTCCLK pulses added
                                                                during a X -second window = Y - CALM[8:0].
                                                                 with Y = 512, 256, 128 when X = 32, 16, 8 */
#define ERTC_SmoothCalAddPulses_Reset  ((uint32_t)0x00000000) /*!<  The number of RTCCLK pulses subbstited
                                                                 during a 32-second window =   CALM[8:0]. */
#define IS_ERTC_SMOOTH_CAL_ADD(ADD) (((ADD) == ERTC_SmoothCalAddPulses_Set) || \
                                         ((ADD) == ERTC_SmoothCalAddPulses_Reset))

/**
  * @}
  */

/** @defgroup RTC_Smooth_calib_Minus_pulses_Definitions
  * @{
  */
#define  IS_ERTC_SMOOTH_CAL_VALUE(VALUE) ((VALUE) <= 0x000001FF)

/**
  * @}
  */

/** @defgroup RTC_DayLightSaving_Definitions
  * @{
  */
#define ERTC_DayLightSaving_SUB1H   ((uint32_t)0x00020000)
#define ERTC_DayLightSaving_ADD1H   ((uint32_t)0x00010000)
#define IS_ERTC_DAYLIGHT_SAVING(SAVE) (((SAVE) == ERTC_DayLightSaving_SUB1H) || \
                                      ((SAVE) == ERTC_DayLightSaving_ADD1H))

#define ERTC_StoreOperation_Reset        ((uint32_t)0x00000000)
#define ERTC_StoreOperation_Set          ((uint32_t)0x00040000)
#define IS_ERTC_STORE_OPERATION(OPERATION) (((OPERATION) == ERTC_StoreOperation_Reset) || \
                                           ((OPERATION) == ERTC_StoreOperation_Set))
/**
  * @}
  */

/** @defgroup RTC_Tamper_Trigger_Definitions
  * @{
  */
#define ERTC_TamperTrig_RisingEdge            ((uint32_t)0x00000000)
#define ERTC_TamperTrig_FallingEdge           ((uint32_t)0x00000001)
#define ERTC_TamperTrig_LowLevel              ((uint32_t)0x00000000)
#define ERTC_TamperTrig_HighLevel             ((uint32_t)0x00000001)
#define IS_ERTC_TAMPER_TRIG(TRIG) (((TRIG) == ERTC_TamperTrig_RisingEdge) || \
                                        ((TRIG) == ERTC_TamperTrig_FallingEdge) || \
                                        ((TRIG) == ERTC_TamperTrig_LowLevel) || \
                                        ((TRIG) == ERTC_TamperTrig_HighLevel))

/**
  * @}
  */

/** @defgroup RTC_Tamper_Filter_Definitions
  * @{
  */
#define ERTC_TamperFilter_Disable   ((uint32_t)0x00000000) /*!< Tamper filter is disabled */

