RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/inc/at32f4xx_ertc.h
#define ERTC_TamperFilter_2Sample   ((uint32_t)0x00000800) /*!< Tamper is activated after 2
                                                          consecutive samples at the active level */
#define ERTC_TamperFilter_4Sample   ((uint32_t)0x00001000) /*!< Tamper is activated after 4
                                                          consecutive samples at the active level */
#define ERTC_TamperFilter_8Sample   ((uint32_t)0x00001800) /*!< Tamper is activated after 8
                                                          consecutive samples at the active level. */
#define IS_ERTC_TAMPER_FILTER(FILTER) (((FILTER) == ERTC_TamperFilter_Disable) || \
                                      ((FILTER) == ERTC_TamperFilter_2Sample) || \
                                      ((FILTER) == ERTC_TamperFilter_4Sample) || \
                                      ((FILTER) == ERTC_TamperFilter_8Sample))
/**
  * @}
  */

/** @defgroup RTC_Tamper_Sampling_Frequencies_Definitions
  * @{
  */
#define ERTC_TamperSamplingFreq_CLK_Div32768  ((uint32_t)0x00000000) /*!< Each of the tamper inputs are sampled
                                                                           with a frequency =  RTCCLK / 32768 */
#define ERTC_TamperSamplingFreq_CLK_Div16384  ((uint32_t)0x000000100) /*!< Each of the tamper inputs are sampled
                                                                            with a frequency =  RTCCLK / 16384 */
#define ERTC_TamperSamplingFreq_CLK_Div8192   ((uint32_t)0x00000200) /*!< Each of the tamper inputs are sampled
                                                                           with a frequency =  RTCCLK / 8192  */
#define ERTC_TamperSamplingFreq_CLK_Div4096   ((uint32_t)0x00000300) /*!< Each of the tamper inputs are sampled
                                                                           with a frequency =  RTCCLK / 4096  */
#define ERTC_TamperSamplingFreq_CLK_Div2048   ((uint32_t)0x00000400) /*!< Each of the tamper inputs are sampled
                                                                           with a frequency =  RTCCLK / 2048  */
#define ERTC_TamperSamplingFreq_CLK_Div1024   ((uint32_t)0x00000500) /*!< Each of the tamper inputs are sampled
                                                                           with a frequency =  RTCCLK / 1024  */
#define ERTC_TamperSamplingFreq_CLK_Div512    ((uint32_t)0x00000600) /*!< Each of the tamper inputs are sampled
                                                                           with a frequency =  RTCCLK / 512   */
#define ERTC_TamperSamplingFreq_CLK_Div256    ((uint32_t)0x00000700) /*!< Each of the tamper inputs are sampled
                                                                           with a frequency =  RTCCLK / 256   */
#define IS_ERTC_TAMPER_SAMPLING_FREQ(FREQ) (((FREQ) ==ERTC_TamperSamplingFreq_CLK_Div32768) || \
                                           ((FREQ) ==ERTC_TamperSamplingFreq_CLK_Div16384) || \
                                           ((FREQ) ==ERTC_TamperSamplingFreq_CLK_Div8192) || \
                                           ((FREQ) ==ERTC_TamperSamplingFreq_CLK_Div4096) || \
                                           ((FREQ) ==ERTC_TamperSamplingFreq_CLK_Div2048) || \
                                           ((FREQ) ==ERTC_TamperSamplingFreq_CLK_Div1024) || \
                                           ((FREQ) ==ERTC_TamperSamplingFreq_CLK_Div512) || \
                                           ((FREQ) ==ERTC_TamperSamplingFreq_CLK_Div256))

/**
  * @}
  */

  /** @defgroup RTC_Tamper_Pin_Precharge_Duration_Definitions
  * @{
  */
#define ERTC_TamperPrechargeDuration_1RTCCLK ((uint32_t)0x00000000)  /*!< Tamper pins are pre-charged before
                                                                         sampling during 1 RTCCLK cycle */
#define ERTC_TamperPrechargeDuration_2RTCCLK ((uint32_t)0x00002000)  /*!< Tamper pins are pre-charged before
                                                                         sampling during 2 RTCCLK cycles */
#define ERTC_TamperPrechargeDuration_4RTCCLK ((uint32_t)0x00004000)  /*!< Tamper pins are pre-charged before
                                                                         sampling during 4 RTCCLK cycles */
#define ERTC_TamperPrechargeDuration_8RTCCLK ((uint32_t)0x00006000)  /*!< Tamper pins are pre-charged before
                                                                         sampling during 8 RTCCLK cycles */

#define IS_ERTC_TAMPER_PRECHARGE_DURATION(DURATION) (((DURATION) == ERTC_TamperPrechargeDuration_1RTCCLK) || \
                                                    ((DURATION) == ERTC_TamperPrechargeDuration_2RTCCLK) || \
                                                    ((DURATION) == ERTC_TamperPrechargeDuration_4RTCCLK) || \
                                                    ((DURATION) == ERTC_TamperPrechargeDuration_8RTCCLK))
/**
  * @}
  */

/** @defgroup RTC_Tamper_Pins_Definitions
  * @{
  */
#define ERTC_TAMP_1 ERTC_TPAF_TM1E
#define ERTC_TAMP_2 ERTC_TPAF_TM2E
#define IS_ERTC_TAMP(TAMP) (((TAMP) == ERTC_TAMP_1) || ((TAMP) == ERTC_TAMP_2))

/**
  * @}
  */

/** @defgroup RTC_Tamper_Pin_Selection
  * @{
  */
#define ERTC_TAMPPIN_Default       ((uint32_t)0x00000000)
#define ERTC_TAMPPIN_Pos1          ((uint32_t)0x00010000)
#define IS_ERTC_TAMP_PIN(PIN)      (((PIN) == ERTC_TAMPPIN_Default) || \
                                    ((PIN) == ERTC_TAMPPIN_Pos1))
/* Legacy Defines */
#define ERTC_TAMPPIN_PC13           ERTC_TAMPPIN_Default
#define ERTC_TAMPPIN_PI8            ERTC_TAMPPIN_Pos1
/**
  * @}
  */

/** @defgroup RTC_TimeStamp_Pin_Selection
  * @{
  */
#define ERTC_TimeStampPin_PC13              ((uint32_t)0x00000000)
#define ERTC_TimeStampPin_PI8               ((uint32_t)0x00020000)
#define IS_ERTC_TIMESTAMP_PIN(PIN) (((PIN) == ERTC_TimeStampPin_PC13) || \
                                   ((PIN) == ERTC_TimeStampPin_PI8))

/**
  * @}
  */

/** @defgroup RTC_Output_Type_ALARM_OUT
  * @{
  */
#define ERTC_OutputType_OpenDrain           ((uint32_t)0x00000000)
#define ERTC_OutputType_PushPull            ((uint32_t)0x00040000)
#define IS_ERTC_OUTPUT_TYPE(TYPE) (((TYPE) == ERTC_OutputType_OpenDrain) || \
                                  ((TYPE) == ERTC_OutputType_PushPull))

/**
  * @}
  */

/** @defgroup RTC_Add_1_Second_Parameter_Definitions
  * @{
  */
#define ERTC_ShiftAdd1S_Reset      ((uint32_t)0x00000000)
#define ERTC_ShiftAdd1S_Set        ((uint32_t)0x80000000)
#define IS_ERTC_SHIFT_ADD1S(SEL) (((SEL) == ERTC_ShiftAdd1S_Reset) || \
                                 ((SEL) == ERTC_ShiftAdd1S_Set))
/**
  * @}
  */

/** @defgroup RTC_Substract_Fraction_Of_Second_Value
  * @{
  */
#define IS_ERTC_SHIFT_SUBFS(FS) ((FS) <= 0x00007FFF)

/**
  * @}
  */

/** @defgroup RTC_Backup_Registers_Definitions
  * @{
  */

#define ERTC_BKP_DT0                       ((uint32_t)0x00000000)
#define ERTC_BKP_DT1                       ((uint32_t)0x00000001)
#define ERTC_BKP_DT2                       ((uint32_t)0x00000002)
#define ERTC_BKP_DT3                       ((uint32_t)0x00000003)
#define ERTC_BKP_DT4                       ((uint32_t)0x00000004)
#define ERTC_BKP_DT5                       ((uint32_t)0x00000005)
#define ERTC_BKP_DT6                       ((uint32_t)0x00000006)
#define ERTC_BKP_DT7                       ((uint32_t)0x00000007)
#define ERTC_BKP_DT8                       ((uint32_t)0x00000008)
#define ERTC_BKP_DT9                       ((uint32_t)0x00000009)
#define ERTC_BKP_DT10                      ((uint32_t)0x0000000A)
#define ERTC_BKP_DT11                      ((uint32_t)0x0000000B)
#define ERTC_BKP_DT12                      ((uint32_t)0x0000000C)
#define ERTC_BKP_DT13                      ((uint32_t)0x0000000D)
#define ERTC_BKP_DT14                      ((uint32_t)0x0000000E)
#define ERTC_BKP_DT15                      ((uint32_t)0x0000000F)
#define ERTC_BKP_DT16                      ((uint32_t)0x00000010)
#define ERTC_BKP_DT17                      ((uint32_t)0x00000011)
#define ERTC_BKP_DT18                      ((uint32_t)0x00000012)
#define ERTC_BKP_DT19                      ((uint32_t)0x00000013)
#define IS_ERTC_BKP(BKP)                  (((BKP) == ERTC_BKP_DT0) || \
                                           ((BKP) == ERTC_BKP_DT1) || \
                                           ((BKP) == ERTC_BKP_DT2) || \
                                           ((BKP) == ERTC_BKP_DT3) || \
                                           ((BKP) == ERTC_BKP_DT4) || \
                                           ((BKP) == ERTC_BKP_DT5) || \
                                           ((BKP) == ERTC_BKP_DT6) || \
                                           ((BKP) == ERTC_BKP_DT7) || \
                                           ((BKP) == ERTC_BKP_DT8) || \
                                           ((BKP) == ERTC_BKP_DT9) || \
                                           ((BKP) == ERTC_BKP_DT10) || \
                                           ((BKP) == ERTC_BKP_DT11) || \
                                           ((BKP) == ERTC_BKP_DT12) || \
                                           ((BKP) == ERTC_BKP_DT13) || \
                                           ((BKP) == ERTC_BKP_DT14) || \
                                           ((BKP) == ERTC_BKP_DT15) || \
                                           ((BKP) == ERTC_BKP_DT16) || \
                                           ((BKP) == ERTC_BKP_DT17) || \
                                           ((BKP) == ERTC_BKP_DT18) || \
                                           ((BKP) == ERTC_BKP_DT19))
/**
  * @}
  */

/** @defgroup RTC_Input_parameter_format_definitions
  * @{
  */
#define ERTC_Format_BIN                    ((uint32_t)0x000000000)
#define ERTC_Format_BCD                    ((uint32_t)0x000000001)
#define IS_ERTC_FORMAT(FORMAT) (((FORMAT) == ERTC_Format_BIN) || ((FORMAT) == ERTC_Format_BCD))

/**
  * @}
  */

/** @defgroup RTC_Flags_Definitions
  * @{
  */
#define ERTC_FLAG_RECALPDF                 ((uint32_t)0x00010000)
#define ERTC_FLAG_TP1F                     ((uint32_t)0x00002000)
#define ERTC_FLAG_TP2F                     ((uint32_t)0x00004000)
#define ERTC_FLAG_TSOF                     ((uint32_t)0x00001000)
#define ERTC_FLAG_TSF                      ((uint32_t)0x00000800)
#define ERTC_FLAG_WATF                     ((uint32_t)0x00000400)
#define ERTC_FLAG_ALBF                     ((uint32_t)0x00000200)
#define ERTC_FLAG_ALAF                     ((uint32_t)0x00000100)
#define ERTC_FLAG_INITF                    ((uint32_t)0x00000040)
#define ERTC_FLAG_RSF                      ((uint32_t)0x00000020)
#define ERTC_FLAG_INITS                    ((uint32_t)0x00000010)
#define ERTC_FLAG_SFP                      ((uint32_t)0x00000008)
#define ERTC_FLAG_WATWF                    ((uint32_t)0x00000004)
#define ERTC_FLAG_ALBWF                    ((uint32_t)0x00000002)
#define ERTC_FLAG_ALAWF                    ((uint32_t)0x00000001)
#define IS_ERTC_GET_FLAG(FLAG) (((FLAG) == ERTC_FLAG_TSOF) || ((FLAG) == ERTC_FLAG_TSF) || \
                                ((FLAG) == ERTC_FLAG_WATF) || ((FLAG) == ERTC_FLAG_ALBF) || \
                                ((FLAG) == ERTC_FLAG_ALAF) || ((FLAG) == ERTC_FLAG_INITF) || \
                                ((FLAG) == ERTC_FLAG_RSF) || ((FLAG) == ERTC_FLAG_WATWF) || \
                                ((FLAG) == ERTC_FLAG_ALBWF) || ((FLAG) == ERTC_FLAG_ALAWF) || \
                                ((FLAG) == ERTC_FLAG_TP1F) || ((FLAG) == ERTC_FLAG_RECALPDF) || \
                                ((FLAG) == ERTC_FLAG_TP2F) ||((FLAG) == ERTC_FLAG_SFP))
#define IS_ERTC_CLEAR_FLAG(FLAG) (((FLAG) != (uint32_t)RESET) && (((FLAG) & 0xFFFF00DF) == (uint32_t)RESET))
/**
  * @}
  */

/** @defgroup RTC_Interrupts_Definitions
  * @{
  */
#define ERTC_INT_TS                         ((uint32_t)0x00008000)
#define ERTC_INT_WAT                        ((uint32_t)0x00004000)
#define ERTC_INT_ALB                        ((uint32_t)0x00002000)
#define ERTC_INT_ALA                        ((uint32_t)0x00001000)
#define ERTC_INT_TAMP                       ((uint32_t)0x00000004) /* Used only to Enable the Tamper Interrupt */
#define ERTC_INT_TAMP1                      ((uint32_t)0x00020000)
#define ERTC_INT_TAMP2                      ((uint32_t)0x00040000)

